app/controllers/questions_controller.rb

  def index
    tenant = Tenant.where(api_key: params[:api_key]).first if params[:api_key]
    if tenant.present? && !tenant.should_throttle?
---
SELECT  "tenants".* FROM "tenants" WHERE "tenants"."api_key" = ?  ORDER BY "tenants"."id" ASC LIMIT 1  [["api_key", "blah"]]
SELECT  "tenants".* FROM "tenants" WHERE (blah)  ORDER BY "tenants"."id" ASC LIMIT 1